//RUNJCL  JOB 'IBMUSER',
//            'MAC',
//            CLASS=A,
//            MSGCLASS=X,
//            NOTIFY=&SYSUID
//        SET PGMCBL=PGM012V2
//        SET FILETO=FILE012
//STEP1  EXEC PGM=&PGMCBL
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.PROG.LOAD
//SYSPRINT DD SYSOUT=*
//FILEIN   DD DSN=IBMUSER.FILES(&FILETO),DISP=SHR
//SYSIN    DD DUMMY
//