//JCLCOMP JOB NOTIFY=&SYSUID,
//            MSGLEVEL=(1,1),
//            MSGCLASS=A,
//            CLASS=A
//            SET PGMCBL=PGM014
//CALLIGY    EXEC IGYWCL,PARM='LIB'
//STEPLIB      DD DSN=IGY410.SIGYCOMP,DISP=SHR
//COBOL.SYSIN  DD DSN=IBMUSER.PROG.CBL(&PGMCBL),DISP=SHR
//COBOL.SYSLIB DD DISP=SHR,DSN=IBMUSER.PROG.COPY 
//LKED.SYSLIB  DD DSN=IBMUSER.PROG.LOAD,DISP=SHR
//             DD DSN=CEE.SCEELKED,DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.PROG.LOAD(&PGMCBL),DISP=SHR
//