       FD ()
           RECORD CONTAINS 80 CHARACTERS.
       01 ()-ENREG.
            02 ()-COMPTE  PIC 9(6).
            02 ()-NOM     PIC X(20).
            02 ()-DATE    PIC X(10).
            02 FILLER     PIC X(44).